import type { IQuestion } from "../types/questions.type";

export const QUESTIONS_ABOUT_UKRAINE: IQuestion[] = [
  {
    id: "q1",
    title: "Яка найвища гора України?",
    answers: ["Джомолунгма", "Говерла"],
    correctAnswer: "Говерла",
  },
  {
    id: "q2",
    title: "На території яких сучасних країн існувала Трипільська Культура?",
    answers: [
      "Україна, Молдова, Румунія",
      "Україна, Словаччина, Польща",
      "Україна, росія, білорусь",
    ],
    correctAnswer: "Україна, Молдова, Румунія",
  },
  {
    id: "q3",
    title: "Час існування Київської Русі",
    answers: ["кін. 9 - сер. 13 ст", "8 - 10 ст", "кін. 11 - поч. 15 ст"],
    correctAnswer: "кін. 9 - сер. 13 ст",
  },
  {
    id: "q4",
    title: "Як звали князя Київської Русі, чия донька стала королевою Франції?",
    answers: ["Володимир Ольгердович", "Ярослав Мудрий", "Ярослав Ярославович"],
    correctAnswer: "Ярослав Мудрий",
  },
  {
    id: "q5",
    title: "Як звали ту доньку?",
    answers: ["Оксана Ярославівна", "Анна Ярославівна", "Світлана Віталіївна"],
    correctAnswer: "Анна Ярославівна",
  },
  {
    id: "q6",
    title: "Яка київська станція метро є найглибшою в світі?",
    answers: ["Лук'янівська", "Дорогожичі", "Арсенальна"],
    correctAnswer: "Арсенальна",
  },
  {
    id: "q7",
    title: "Яка її глибина?",
    answers: ["105м", "255м", "102м"],
    correctAnswer: "105м",
  },
  {
    id: "q8",
    title:
      "У Луцьку знаходиться найдовщий житловий будинок в Європі. Яка його довжина?",
    answers: ["700м", "2.5км", "1.25км"],
    correctAnswer: "2.5км",
  },
  {
    id: "q9",
    title: "Скільки у ньому під'їздів?",
    answers: ["120", "172", "3"],
    correctAnswer: "120",
  },
  {
    id: "q10",
    title:
      "Кажуть, що Харків одине з найбільш освічених міст України. Скільки там ВУЗів?",
    answers: ["48", "10", "80"],
    correctAnswer: "80",
  },
  {
    id: "q11",
    title:
      "Перша демократична конституція в світі була українська. Ким вона була написана?",
    answers: ["Богдан Грушевський", "Оксана Ярославівна", "Пилип Орлик"],
    correctAnswer: "Пилип Орлик",
  },
  {
    id: "q12",
    title:
      "Одне з перших демократичних утворень в світі було на території України. Яку назву воно мало?",
    answers: ["Київська Русь", "Запорізька Січ", "Польська Унія"],
    correctAnswer: "Запорізька Січ",
  },
  {
    id: "q13",
    title:
      "Як називається український музичний інструмент, який є найдовшим у світі?",
    answers: ["Трембіта", "Дримба", "Ліра"],
    correctAnswer: "Тримбіта",
  },
  {
    id: "q14",
    title: "Яка її довжина?",
    answers: ["3-5м", "1-2м", "5-8м"],
    correctAnswer: "3-5м",
  },
  {
    id: "q15",
    title:
      "У Тернопільській області розташована найдовша печера у світі. Яка її назва?",
    answers: ["Нейтральна", "Оптимістична", "Песимістична"],
    correctAnswer: "Оптимістична",
  },
  {
    id: "q16",
    title: "Яка її довжина?",
    answers: ["100км", "745м", "260км"],
    correctAnswer: "260км",
  },
  {
    id: "q17",
    title:
      "Як називається одна з найвідоміших різдвяних пісень у світі, написана українським композитором?",
    answers: ["Щедрик", "Ой на горі два дубки", "Як умру то поховайте..."],
    correctAnswer: "Щедрик",
  },
  {
    id: "q18",
    title: "Хто цей композитор?",
    answers: ["Нестор Ольжич", "Володимир Івасюк", "Микола Леонтович"],
    correctAnswer: "Микола Леонтович",
  },
  {
    id: "q19",
    title: "Географічний центр Європи знаходиться в Україні. У якому місті?",
    answers: ["Сихів", "Рахів", "Обухів"],
    correctAnswer: "Рахів",
  },
  {
    id: "q20",
    title:
      "Окрім 'Мрії', який ще один з найпотужніших й найбільших літаків було розроблено в Україні?",
    answers: ["Руслан", "Віталік", "Людмила"],
    correctAnswer: "Руслан",
  },
  {
    id: "q21",
    title:
      "Український літак 'Мрія' поставив рекорд й перевіз найтящий в історії авіації вантаж. Яка маса вантажу?",
    answers: ["111т", "253т", "310т"],
    correctAnswer: "253т",
  },
  {
    id: "q22",
    title: "Який відомий українець винайшов гелікоптер?",
    answers: ["Сергій Корольов", "Георгій Адлер", "Ігор Сікорський"],
    correctAnswer: "Ігор Сікорський",
  },
  {
    id: "q23",
    title:
      "Дмитро Халаджі, український пауерліфтер, включений до КРГ більше 20 разів. Один з його рекордів називається 'Кузня Диявола', в якому Дмитро лежить на цвяхах, накритий сталевою плитою, по якій б'ють кувалдами. Яка маса плити?",
    answers: ["700кг", "550кг", "350кг"],
    correctAnswer: "700кг",
  },
  {
    id: "q24",
    title: "Як українською буде слово 'скули'?",
    answers: ["полічки", "вилиці", "милиці"],
    correctAnswer: "вилиці",
  },
  {
    id: "q25",
    title: "Що означає українською слово 'дармовис'?",
    answers: ["пісюн", "шнурок", "брелок"],
    correctAnswer: "брелок",
  },
  {
    id: "q26",
    title: "Що означає українською слово 'баляндраси'?",
    answers: [
      "проста смачна закуска на святковому столі",
      "порожні та веселі розмови про щось незначне",
      "чоловіки легкої поведінки",
    ],
    correctAnswer: "порожні та веселі розмови про щось незначне",
  },
  {
    id: "q27",
    title: "Що означає українською слово 'видноколо'?",
    answers: ["обрій", "ніздря", "іллюмінатор"],
    correctAnswer: "обрій",
  },
  {
    id: "q28",
    title: "Що означає українською слово 'легіт'?",
    answers: ["дитячий сміх", "легкий та приємний вітерець", "звук лебедів"],
    correctAnswer: "легкий та приємний вітерець",
  },
  {
    id: "q29",
    title: "Що означає українською слово 'ланіти'?",
    answers: ["груди", "полічки", "щоки"],
    correctAnswer: "щоки",
  },
];
